
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Linux 之父-- Linus Torvalds · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="gil.html" />
    
    
    <link rel="prev" href="rms.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="ken.html">
            
                <a href="ken.html">
            
                    
                    Unix 之父-- Ken Thompson
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="vint.html">
            
                <a href="vint.html">
            
                    
                    Internet 之父-- Vint Cerf
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ray.html">
            
                <a href="ray.html">
            
                    
                    Email 之父-- Ray Tomlinson
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="pg.html">
            
                <a href="pg.html">
            
                    
                    Web App 之父-- Paul Graham
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="rms.html">
            
                <a href="rms.html">
            
                    
                    自由软件之父-- Richard Stallman
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.7" data-path="linus.html">
            
                <a href="linus.html">
            
                    
                    Linux 之父-- Linus Torvalds
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="gil.html">
            
                <a href="gil.html">
            
                    
                    密码朋克之父-- John Gilmore
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="lee.html">
            
                <a href="lee.html">
            
                    
                     Web 之父--Tim Berners-Lee
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="marc.html">
            
                <a href="marc.html">
            
                    
                    互联网民用化之父--马克安德森
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="barlow.html">
            
                <a href="barlow.html">
            
                    
                    网络空间独立宣言之父--John Barlow 
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Linux 之父-- Linus Torvalds</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>1969&#x5E74;&#x51FA;&#x751F;&#x7684; Linus Torvalds &#x662F; Linux &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E4B;&#x7236;&#xFF0C;&#x800C; Linux &#x662F;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x57FA;&#x77F3;&#xFF0C;&#x6240;&#x4EE5; Linus &#x4E5F;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x5960;&#x57FA;&#x4EBA;&#x4E4B;&#x4E00;&#x3002;</p>
<p><img src="https://img.haoqicat.com/2019072501.jpg" alt=""></p>
<h2 id="linux-&#x662F;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x57FA;&#x77F3;">Linux &#x662F;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x57FA;&#x77F3;</h2>
<p>Linux &#x662F;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x57FA;&#x77F3;&#xFF0C;&#x4F53;&#x73B0;&#x5728;&#x4E0B;&#x9762;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#xFF0C;Linux &#x662F;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x5668;&#x7684;&#x4E8B;&#x5B9E;&#x6807;&#x51C6;&#x3002;&#x5168;&#x4E16;&#x754C;&#x7684;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x5668;&#x6709;&#x767E;&#x5206;&#x4E4B;&#x4E03;&#x516B;&#x5341;&#x90FD;&#x662F;&#x4F7F;&#x7528; Linux &#x4F5C;&#x4E3A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x3002;&#x4E92;&#x8054;&#x7F51;&#x672C;&#x8D28;&#x662F;&#x5F88;&#x591A;&#x9075;&#x4ECE;&#x7EDF;&#x4E00;&#x89C4;&#x5219;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7EC4;&#x6210;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x7EDF;&#x4E00;&#x89C4;&#x5219;&#x7684;&#x8F7D;&#x4F53;&#x662F;&#x5F88;&#x591A;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x8F6F;&#x4EF6;&#x7684;&#x8F7D;&#x4F53;&#x5C31;&#x662F;&#x5F00;&#x6E90;&#x514D;&#x8D39;&#x5E76;&#x4E14;&#x4E0D;&#x88AB;&#x5355;&#x4E00;&#x5546;&#x4E1A;&#x5B9E;&#x4F53;&#x6240;&#x63A7;&#x5236;&#x7684; Linux &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#xFF0C;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x601D;&#x60F3;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x4E4B;&#x6240;&#x4EE5;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x5173;&#x952E;&#x3002;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x8FD0;&#x52A8;&#xFF0C;&#x5F00;&#x59CB;&#x4E8E;&#x81EA;&#x7531;&#x8F6F;&#x4EF6;&#xFF0C;&#x4F46;&#x662F;&#x817E;&#x98DE;&#x4E8E; Linux &#x793E;&#x533A;&#x3002;&#x5F00;&#x6E90;&#xFF0C;&#x4E5F;&#x5C31;&#x662F; Open Source &#x8FD9;&#x4E2A;&#x8BCD;&#xFF0C;&#x662F;&#x7531; Eric Steven Raymond &#x548C; Linus &#x7B49;&#x4EBA;&#x63D0;&#x51FA;&#x5E76;&#x9610;&#x8FF0;&#x7684;&#x3002;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x5982;&#x4F55;&#x5F00;&#x53D1;&#xFF0C;&#x5305;&#x62EC;&#x56E2;&#x961F;&#x5982;&#x4F55;&#x7EC4;&#x7EC7;&#x534F;&#x8C03;&#xFF0C;Linus &#x672C;&#x4EBA;&#x5176;&#x5B9E;&#x53D1;&#x6325;&#x4E86;&#x96BE;&#x4EE5;&#x60F3;&#x8C61;&#x7684;&#x5173;&#x952E;&#x4F5C;&#x7528;&#x3002;&#x4ED6;&#x8BF4;</p>
<blockquote>
<p>&#x6211;&#x505A;&#x5F00;&#x6E90;&#xFF0C;&#x56E0;&#x4E3A;&#x5F00;&#x6E90;&#x662F;&#x505A;&#x8F6F;&#x4EF6;&#x7684;&#x552F;&#x4E00;&#x6B63;&#x786E;&#x65B9;&#x5F0F;&#x3002;</p>
</blockquote>
<p>&#x5F00;&#x6E90;&#x4E5F;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x662F;&#x81EA;&#x7531;&#x8F6F;&#x4EF6;&#x7684;&#x4E00;&#x79CD;&#x6539;&#x826F;&#xFF0C;&#x6240;&#x4EE5; Richard Stallman &#x7684;&#x601D;&#x60F3;&#x5F53;&#x7136;&#x4E5F;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x7684;&#x88AB;&#x7EE7;&#x627F;&#x4E86;&#x4E0B;&#x6765;&#xFF0C;Linux &#x7684;&#x6CD5;&#x5F8B;&#x6388;&#x6743;&#x534F;&#x8BAE;&#x4E5F;&#x59CB;&#x7EC8;&#x90FD;&#x662F; GPL &#x3002;</p>
<p>&#x603B;&#x4E4B;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x57FA;&#x77F3;&#x5FC5;&#x987B;&#x662F;&#x81EA;&#x7531;&#x7684;&#xFF0C;&#x4E0D;&#x53D7;&#x5355;&#x4E00;&#x65B9;&#x63A7;&#x5236;&#x7684;&#xFF0C;&#x5F00;&#x6E90;&#x548C;&#x514D;&#x8D39;&#x7684; Linux &#x6784;&#x6210;&#x4E86;&#x8FD9;&#x4E2A;&#x57FA;&#x77F3;&#x3002;</p>
<h2 id="linux-&#x662F;&#x5982;&#x4F55;&#x8BDE;&#x751F;&#x7684;&#xFF1F;">Linux &#x662F;&#x5982;&#x4F55;&#x8BDE;&#x751F;&#x7684;&#xFF1F;</h2>
<p>&#x4E0B;&#x9762;&#x8BB2;&#x8BB2; Linus &#x662F;&#x5982;&#x4F55;&#x521B;&#x9020; Linux &#x7684;&#x3002;</p>
<p>Linus &#x662F;&#x82AC;&#x5170;&#x4EBA;&#xFF0C;10&#x5C81;&#x7684;&#x65F6;&#x5019;&#x5728;&#x4E00;&#x53F0;&#x540D;&#x53EB; Commodore Vic 20 &#x7684;&#x673A;&#x5668;&#x4E0A;&#x5B66;&#x4E60;&#x4E86;&#x7F16;&#x7A0B;&#x3002;1988&#x5E74; Linus &#x4E0A;&#x5927;&#x5B66;&#x4E86;&#xFF0C;&#x5F88;&#x5FEB;&#x5C31;&#x559C;&#x6B22;&#x4E0A;&#x4E86; Unix &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;&#x4F46;&#x662F;&#x5F53;&#x65F6; Unix &#x5728;&#x6B27;&#x6D32;&#x5F88;&#x96BE;&#x4E70;&#x5230;&#xFF0C;&#x4E5F;&#x975E;&#x5E38;&#x7684;&#x8D35;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x4E8C;&#x7684;&#x65F6;&#x5019; Linus &#x5C31;&#x5F00;&#x59CB;&#x81EA;&#x5DF1;&#x52A8;&#x624B;&#x5F00;&#x53D1;&#x4E00;&#x6B3E; Unix &#x7684;&#x514B;&#x9686;&#x4E86;&#x3002;&#x4ECE;&#x52A8;&#x624B;&#x5230;&#x6700;&#x7EC8; Linus &#x628A; Linux &#x7684;&#x6700;&#x521D;&#x7248;&#x672C;&#x653E;&#x5230;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x5438;&#x5F15;&#x6765;&#x81EA;&#x5168;&#x7403;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x5171;&#x540C;&#x5F00;&#x53D1;&#xFF0C;&#x5176;&#x5B9E;&#x53EA;&#x7528;&#x4E86;&#x4E00;&#x5E74;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>Linus &#x672C;&#x4EBA;&#x505A;&#x8FC7;&#x4E00;&#x6B21;&#x6F14;&#x8BB2;&#x53EB;&#x300A; Linux &#x8D77;&#x6E90;&#x300B;&#xFF0C;&#x8C37;&#x6B4C;&#x4E00;&#x4E0B; The Origin Of Linux youtube &#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x641C;&#x5230;&#x3002;&#x91CC;&#x9762;&#x4ED6;&#x81EA;&#x5DF1;&#x4ECB;&#x7ECD;&#x4E86;&#x80FD;&#x8FD9;&#x4E48;&#x5FEB;&#x5B8C;&#x6210; Linux &#x7684;&#x539F;&#x56E0;&#x6709;&#x8FD9;&#x4E48;&#x51E0;&#x4E2A;&#xFF1A;</p>
<ul>
<li><p>&#x7B2C;&#x4E00;&#xFF0C;Linus &#x4ECE;&#x5C0F;&#x5C31;&#x559C;&#x6B22;&#x73A9; CPU &#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x5C0F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD8;&#x662F;&#x901A;&#x8FC7;0&#x548C;1&#x8FDB;&#x884C;&#x7F16;&#x7A0B;&#xFF0C;&#x73A9;&#x7684;&#x5176;&#x5B9E;&#x4E0D;&#x662F;&#x7F16;&#x7A0B;&#xFF0C;&#x800C;&#x662F;&#x7535;&#x5B50;&#x7535;&#x8DEF;&#xFF0C;&#x90A3;&#x65F6;&#x5019; CPU &#x662F;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x786C;&#x4EF6;&#x7535;&#x8DEF;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x8111;&#x5B50;&#x8BB0;&#x4F4F;&#x3002;</p>
</li>
<li><p>&#x7B2C;&#x4E8C;&#xFF0C;Unix &#x548C; C &#x5728;&#x9ED1;&#x5BA2;&#x793E;&#x533A;&#x7684;&#x7EDF;&#x6CBB;&#x5730;&#x4F4D;&#x5F53;&#x65F6;&#x6162;&#x6162;&#x786E;&#x7ACB;&#x8D77;&#x6765;&#x4E86;&#x3002;Linus &#x4E5F;&#x662F;&#x5927;&#x4E00;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x624D;&#x771F;&#x6B63;&#x5B66;&#x4E60;&#x4E86; C &#xFF0C;&#x7136;&#x540E;&#x76F4;&#x63A5;&#x5C31;&#x52A8;&#x624B;&#x5F00;&#x59CB;&#x5F00;&#x53D1;&#x81EA;&#x5DF1;&#x7684; Unix &#x4E86;&#xFF0C;&#x6CA1;&#x9519; Linux &#x7684;&#x610F;&#x601D;&#x5C31;&#x662F; Linus &#x7684; Unix &#x3002;&#x4F7F;&#x7528; C &#xFF0C;&#x5F00;&#x53D1;&#x7C7B; Unix &#x7CFB;&#x7EDF;&#xFF0C;&#x4E5F;&#x662F;&#x5F53;&#x65F6;&#x65E0;&#x6BD4;&#x6B63;&#x786E;&#x7684;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#xFF0C;&#x76F4;&#x63A5;&#x5BFC;&#x81F4;&#x4E86;&#xFF0C;Linux &#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x628A; GNU &#x9879;&#x76EE;&#x7684;&#x5F88;&#x591A;&#x7A0B;&#x5E8F;&#x76F4;&#x63A5;&#x7528;&#x5230; Linux &#x4E0A;&#xFF0C;&#x56E0;&#x4E3A; GNU &#x7CFB;&#x7EDF;&#x4E5F;&#x662F;&#x4E00;&#x4E2A; Unix &#x514B;&#x9686;&#x3002;</p>
</li>
</ul>
<p>&#x6709;&#x610F;&#x601D;&#x7684;&#x662F;&#xFF0C;&#x76F4;&#x5230; Linux &#x4F5C;&#x4E3A;&#x4E92;&#x8054;&#x7F51;&#x670D;&#x52A1;&#x5668;&#x7684;&#x7EDF;&#x6CBB;&#x5730;&#x4F4D;&#x786E;&#x7ACB;&#x4EE5;&#x540E;&#xFF0C;Linus &#x81EA;&#x5DF1;&#x4E5F;&#x575A;&#x6301;&#x8BA4;&#x4E3A;&#xFF0C;Linux &#x505A;&#x4E2A;&#x4EBA;&#x5DE5;&#x4F5C;&#x7AD9;&#x662F;&#x4ED6;&#x6700;&#x5173;&#x6CE8;&#x7684;&#x89D2;&#x5EA6;&#x3002;&#x4F46;&#x662F;&#x5F00;&#x6E90;&#x793E;&#x533A;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x6709;&#x610F;&#x601D;&#xFF0C;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x4E5F;&#x4E0D;&#x662F;&#x4EE5;&#x521B;&#x4E16;&#x4EBA;&#x7684;&#x610F;&#x613F;&#x4E3A;&#x8F6C;&#x79FB;&#x7684;&#x3002;&#x65F6;&#x4EE3;&#x9700;&#x8981;&#x4E92;&#x8054;&#x7F51;&#x670D;&#x52A1;&#x5668;&#x7CFB;&#x7EDF;&#xFF0C;Linux &#x7684;&#x817E;&#x98DE;&#x4E5F;&#x6B63;&#x662F;&#x56E0;&#x4E3A;&#x80DC;&#x4EFB;&#x4E86;&#x8FD9;&#x4E2A;&#x89D2;&#x8272;&#x3002;&#x540E;&#x6765; Linux &#x5728;&#x8D85;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;&#x548C;&#x624B;&#x673A;&#x9886;&#x57DF;&#xFF08;&#x5B89;&#x5353;&#x5C31;&#x662F; Linux &#x7CFB;&#x7EDF;&#xFF09;&#x53D6;&#x5F97;&#x4E86;&#x7EDF;&#x6CBB;&#x5730;&#x4F4D;&#xFF0C;&#x552F;&#x72EC;&#x5728;&#x4E2A;&#x4EBA;&#x5DE5;&#x4F5C;&#x7AD9;&#x9886;&#x57DF;&#x8FD8;&#x662F;&#x6CA1;&#x6709;&#x8D85;&#x8FC7;&#x82F9;&#x679C;&#x548C;&#x5FAE;&#x8F6F;&#x3002;</p>
<p>2000&#x5E74;&#x7684;&#x65F6;&#x5019;&#x65F6;&#x4EE3;&#x6742;&#x5FD7;&#x8BC4;&#x9009;&#x4E86;&#x4E0A;&#x4E2A;&#x4E16;&#x7EAA;&#x6700;&#x6709;&#x5F71;&#x54CD;&#x529B;&#x7684;100&#x4F4D;&#x4EBA;&#x7269;&#xFF0C;Linus &#x6392;&#x5728;&#x4E86;&#x7B2C;17&#x4F4D;&#xFF0C;&#x4ED6;&#x524D;&#x9762;&#x662F;&#x4E18;&#x5409;&#x5C14;&#xFF0C;&#x540E;&#x9762;&#x662F;&#x66FC;&#x5FB7;&#x62C9;&#x3002;&#x6BD4;&#x5C14;&#x76D6;&#x8328;&#x7684;&#x6392;&#x540D;&#x8FDC;&#x8FDC;&#x5728;&#x540E;&#x9762;&#x3002;&#x4EBA;&#x4EEC;&#x4F1A;&#x611F;&#x6069;&#x4E3A;&#x5927;&#x5BB6;&#x94FA;&#x8DEF;&#x7684;&#x4EBA;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x81EA;&#x5DF1;&#x6784;&#x5EFA;&#x5B8F;&#x4F1F;&#x5BAB;&#x6BBF;&#x7684;&#x4EBA;&#xFF0C;&#x5F00;&#x653E;&#x7684;&#x4EA7;&#x4E1A;&#x94FE;&#x8FDC;&#x6BD4;&#x5C01;&#x95ED;&#x4EA7;&#x4E1A;&#x94FE;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x591A;&#x3002;</p>
<h2 id="git-&#x6539;&#x53D8;&#x4E16;&#x754C;">Git &#x6539;&#x53D8;&#x4E16;&#x754C;</h2>
<p>Linus &#x4E3B;&#x8981;&#x7684;&#x9879;&#x76EE;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#xFF0C;&#x4EE4;&#x4EBA;&#x53F9;&#x670D;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x9879;&#x76EE;&#x90FD;&#x6539;&#x53D8;&#x4E86;&#x4E16;&#x754C;&#x3002;&#x4E00;&#x4E2A;&#x662F; Linux &#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F; Git &#x3002;Git &#x662F;&#x50BB; x &#x7684;&#x610F;&#x601D;&#x3002;Linus &#x8C03;&#x4F83;&#x8BF4;&#xFF0C;</p>
<blockquote>
<p>&#x6211;&#x4ECE;&#x6765;&#x90FD;&#x662F;&#x4E2A;&#x81EA;&#x6211;&#x81A8;&#x80C0;&#x7684;&#x6DF7;&#x86CB;&#xFF0C;&#x6240;&#x6709;&#x6211;&#x7684;&#x9879;&#x76EE;&#x6211;&#x90FD;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x540D;&#x5B57;&#x6765;&#x547D;&#x540D;&#xFF0C;&#x9996;&#x5148;&#x662F; Linux &#xFF0C;&#x73B0;&#x5728;&#x662F; Git &#x3002;</p>
</blockquote>
<p>Git &#x662F;&#x4E00;&#x4E2A;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x7248;&#x672C;&#x63A7;&#x5236;&#x5DE5;&#x5177;&#xFF0C;&#x662F; Linus &#x4E8C;&#x5341;&#x5E74;&#x6765;&#x7BA1;&#x7406; Linux &#x9879;&#x76EE;&#x7684;&#x7ECF;&#x9A8C;&#x603B;&#x7ED3;&#x3002;Linus &#x8BF4;</p>
<blockquote>
<p>If are not distributed, you are not worth using.</p>
<p>&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#xFF0C;&#x4F60;&#x5C31;&#x4E0D;&#x503C;&#x5F97;&#x88AB;&#x4F7F;&#x7528;</p>
</blockquote>
<p>&#x8FD9;&#x91CC;&#x7684;&#x4F60;&#xFF0C;&#x6307;&#x7684;&#x662F;&#x4E4B;&#x524D;&#x7684;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7684;&#x884C;&#x4E1A;&#x6807;&#x51C6; CVS &#x548C; SVN &#x3002;Peter &#x81EA;&#x5DF1;2008&#x5E74;&#x5F00;&#x59CB;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5317;&#x4EAC;&#x7684;&#x516C;&#x53F8;&#x91CC;&#x9762;&#x8FD8;&#x90FD;&#x662F;&#x4EE5; SVN &#x4E3A;&#x4E3B;&#x7684;&#xFF0C;&#x662F;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x7248;&#x672C;&#x63A7;&#x5236;&#xFF0C;&#x4E00;&#x76F4;&#x5230;2010&#x5E74;&#x5DE6;&#x53F3;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x5148;&#x540E;&#x5DE5;&#x4F5C;&#x8FC7;&#x4E24;&#x5BB6;&#x516C;&#x53F8;&#xFF0C;&#x516C;&#x53F8;&#x91CC;&#x53EA;&#x6709;&#x6211;&#x81EA;&#x5DF1;&#x7528; Git &#x3002;&#x800C; Git &#x672C;&#x8EAB;&#x662F;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#xFF0C;&#x5C31;&#x50CF; Linus &#x8BF4;&#x7684;</p>
<blockquote>
<p>&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x662F;&#x7279;&#x6B8A;&#x7684;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x9879;&#x76EE;&#x514B;&#x9686;</p>
</blockquote>
<p>&#x6700;&#x65E9;&#x662F; SourceForge &#x4E0A;&#x9762;&#x6700;&#x652F;&#x6301;&#x4E86; Git &#xFF0C;&#x540E;&#x6765; Github &#x516C;&#x53F8;&#x624D;&#x8BDE;&#x751F;&#x3002;Github &#x662F;&#x57FA;&#x4E8E; Git &#x7684; SASS &#x670D;&#x52A1;&#xFF0C;&#x5F7B;&#x5E95;&#x6539;&#x53D8;&#x4E86;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#xFF0C;&#x56E0;&#x4E3A;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x5230; Github &#x4E0A;&#x627E;&#x5408;&#x9002;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x53BB;&#x53C2;&#x8003;&#x4E86;&#x3002;</p>
<p>&#x4E0D;&#x7BA1;&#x662F; Git &#x548C; Github &#xFF0C;&#x90FD;&#x628A;&#x9879;&#x76EE;&#x56E2;&#x961F;&#x5185;&#x90E8;&#x7684;&#x7BA1;&#x7406;&#x6D41;&#x7A0B;&#xFF0C;&#x751A;&#x81F3;&#x4F26;&#x7406;&#x601D;&#x7EF4;&#x505A;&#x4E86;&#x5927;&#x5E45;&#x5EA6;&#x7684;&#x6C11;&#x4E3B;&#x5316;&#x63A8;&#x52A8;&#x3002;</p>
<h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2>
<p>Linus &#x672C;&#x4EBA;&#x6700;&#x725B;&#x7684;&#x5730;&#x65B9;&#x662F;&#x80FD;&#x628A;&#x68A6;&#x60F3;&#x843D;&#x5230;&#x5B9E;&#x9645;&#x64CD;&#x4F5C;&#x4E2D;&#x3002;Linux &#x662F;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x77E5;&#x540D;&#x7684;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#xFF0C;&#x4E5F;&#x662F;&#x4EBA;&#x7C7B;&#x6709;&#x53F2;&#x4EE5;&#x6765;&#x6784;&#x5EFA;&#x7684;&#x6700;&#x590D;&#x6742;&#x7684;&#x7CFB;&#x7EDF;&#x4E4B;&#x4E00;&#x3002;&#x4F46;&#x662F; Linus &#x6CA1;&#x6709;&#x5EFA;&#x7ACB;&#x68EE;&#x4E25;&#x7684;&#x5C42;&#x7EA7;&#x7EC4;&#x7EC7;&#xFF0C;&#x800C;&#x662F;&#x901A;&#x8FC7;&#x5438;&#x5F15;&#x5168;&#x7403;&#x6570;&#x4EE5;&#x4E07;&#x8BA1;&#x7684;&#x81EA;&#x7531;&#x5F00;&#x53D1;&#x8005;&#x514D;&#x8D39;&#x8D21;&#x732E;&#xFF0C;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x9879;&#x76EE;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7ED9;&#x4EBA;&#x7C7B;&#x5E26;&#x6765;&#x5E0C;&#x671B;&#x7684;&#x5947;&#x8FF9;&#x3002;Linux &#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x4EE3;&#x7801;&#x9879;&#x76EE;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x4E92;&#x8054;&#x7F51;&#x51FA;&#x73B0;&#x4EE5;&#x540E;&#x7684;&#x65B0;&#x7684;&#x4EBA;&#x7C7B;&#x534F;&#x4F5C;&#x65B9;&#x5F0F;&#xFF0C;&#x53EB;&#x505A;&#x5F00;&#x6E90;&#x6A21;&#x5F0F;&#x3002;Linux &#x4EE5;&#x53CA;&#x540E;&#x6765;&#x51FA;&#x73B0;&#x7684; Wikipedia &#x9879;&#x76EE;&#xFF0C;&#x662F;&#x65E0;&#x6570;&#x4EBA;&#x5FC3;&#x4E2D;&#x7684;&#x4EBA;&#x7C7B;&#x5E0C;&#x671B;&#xFF0C;&#x5F00;&#x6E90;&#x6A21;&#x5F0F;&#x5927;&#x6982;&#x7387;&#x4F1A;&#x662F;&#x4EBA;&#x7C7B;&#x793E;&#x4F1A;&#x672A;&#x6765;&#x5728;&#x8F6F;&#x4EF6;&#x4E4B;&#x5916;&#x7684;&#x5404;&#x4E2A;&#x9886;&#x57DF;&#x90FD;&#x8D8A;&#x6765;&#x8D8A;&#x5E38;&#x89C1;&#x7684;&#x534F;&#x4F5C;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x6700;&#x540E;&#x7528;&#x4E00;&#x53E5; Linus &#x7684;&#x8BDD;&#x7ED3;&#x675F;&#x672C;&#x6587;&#xFF1A;</p>
<blockquote>
<p>given enough eyeballs, all bugs are shallow</p>
<p>&#x5BF9;&#x4E8E;&#x5F88;&#x591A;&#x53CC;&#x773C;&#x775B;&#x76EF;&#x7740;&#x7684;&#x4EE3;&#x7801;&#xFF0C;bug &#x662F;&#x65E0;&#x5904;&#x85CF;&#x8EAB;&#x7684;</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="rms.html" class="navigation navigation-prev " aria-label="Previous page: 自由软件之父-- Richard Stallman">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="gil.html" class="navigation navigation-next " aria-label="Next page: 密码朋克之父-- John Gilmore">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Linux 之父-- Linus Torvalds","level":"1.7","depth":1,"next":{"title":"密码朋克之父-- John Gilmore","level":"1.8","depth":1,"path":"gil.md","ref":"gil.md","articles":[]},"previous":{"title":"自由软件之父-- Richard Stallman","level":"1.6","depth":1,"path":"rms.md","ref":"rms.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"linus.md","mtime":"2019-07-25T08:27:00.086Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2019-07-28T23:43:48.482Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

