
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>自由软件之父-- Richard Stallman · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="linus.html" />
    
    
    <link rel="prev" href="pg.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="ken.html">
            
                <a href="ken.html">
            
                    
                    Unix 之父-- Ken Thompson
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="vint.html">
            
                <a href="vint.html">
            
                    
                    Internet 之父-- Vint Cerf
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ray.html">
            
                <a href="ray.html">
            
                    
                    Email 之父-- Ray Tomlinson
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="pg.html">
            
                <a href="pg.html">
            
                    
                    Web App 之父-- Paul Graham
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.6" data-path="rms.html">
            
                <a href="rms.html">
            
                    
                    自由软件之父-- Richard Stallman
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="linus.html">
            
                <a href="linus.html">
            
                    
                    Linux 之父-- Linus Torvalds
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="gil.html">
            
                <a href="gil.html">
            
                    
                    密码朋克之父-- John Gilmore
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="lee.html">
            
                <a href="lee.html">
            
                    
                     Web 之父--Tim Berners-Lee
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="marc.html">
            
                <a href="marc.html">
            
                    
                    互联网民用化之父--马克安德森
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="barlow.html">
            
                <a href="barlow.html">
            
                    
                    网络空间独立宣言之父--John Barlow 
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >自由软件之父-- Richard Stallman</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>Richard Stallman &#x662F;&#x81EA;&#x7531;&#x8F6F;&#x4EF6;&#x57FA;&#x91D1;&#x4F1A;&#x521B;&#x529E;&#x4EBA;&#xFF0C;&#x9876;&#x7EA7;&#x7F16;&#x7A0B;&#x5927;&#x5E08;&#xFF0C;&#x6709;&#x53F2;&#x4EE5;&#x6765;&#x6700;&#x8457;&#x540D;&#x7684;&#x9ED1;&#x5BA2;&#xFF08;&#x6CA1;&#x6709;&#x4E4B;&#x4E00;&#xFF09;&#x3002;&#x4E5F;&#x662F;&#x7535;&#x5F71;&#x300A;&#x9ED1;&#x5BA2;&#x5E1D;&#x56FD;&#x300B;&#x91CC;&#x9762;&#x7684;&#x9884;&#x8A00;&#x5BB6; Morpheus &#xFF0C;&#x4EE5;&#x53CA;&#x4F5C;&#x4E3A;&#x4E92;&#x8054;&#x7F51;&#x57FA;&#x77F3;&#x7684; Linux &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x4E3B;&#x8981;&#x4F5C;&#x8005;&#x4E4B;&#x4E00;&#x3002;</p>
<h2 id="&#x81EA;&#x7531;&#x8F6F;&#x4EF6;&#x8FD0;&#x52A8;">&#x81EA;&#x7531;&#x8F6F;&#x4EF6;&#x8FD0;&#x52A8;</h2>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5F88;&#x591A;&#x4EBA;&#x8A00;&#x5FC5;&#x79F0;&#x5F00;&#x6E90;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x5B9E;&#x5F00;&#x6E90;&#x8FD0;&#x52A8;&#x4E4B;&#x524D;&#xFF0C;&#x8FD8;&#x6709;&#x81EA;&#x7531;&#x8F6F;&#x4EF6;&#x8FD0;&#x52A8;&#xFF0C;&#x800C; Richard Stallman &#x5C31;&#x662F;&#x81EA;&#x7531;&#x8F6F;&#x4EF6;&#x8FD0;&#x52A8;&#x7684;&#x53D1;&#x8D77;&#x4EBA;&#x3002;</p>
<p>Richard &#x662F;&#x6BD4;&#x5C14;&#x76D6;&#x8328;&#x7684;&#x54C8;&#x4F5B;&#x6821;&#x53CB;&#x3002;&#x4F46;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x6BD4;&#x5C14;&#x76D6;&#x8328;&#x5F53;&#x65F6;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x5C0F;&#x9ED1;&#x5BA2;&#xFF0C;&#x800C; Richard &#x662F;&#x8DDF; SUN &#x4E4B;&#x7236; Bill Joy &#x548C; Java &#x4E4B;&#x7236; Gosling &#x540C;&#x4E00;&#x4E2A;&#x7EA7;&#x522B;&#x7684;&#x7F16;&#x7A0B;&#x5927;&#x5E08;&#xFF0C;&#x5708;&#x5185;&#x4E0D;&#x5C11;&#x4EBA;&#x8BA4;&#x4E3A;&#x4ED6;&#x7684;&#x7F16;&#x7A0B;&#x6C34;&#x5E73;&#x8981;&#x6BD4; Linux &#x4E4B;&#x7236; Linus &#x9AD8;&#x3002;&#x4F46;&#x662F;&#x7531;&#x4E8E; Linux &#x9879;&#x76EE;&#x592A;&#x91CD;&#x5927;&#xFF0C;&#x5927;&#x5BB6;&#x8BA4;&#x4E3A;&#xFF0C;Linus &#x662F;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x8457;&#x540D;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x800C; Richard &#x662F;&#x6709;&#x53F2;&#x4EE5;&#x6765;&#x6700;&#x8457;&#x540D;&#x7684;&#x9ED1;&#x5BA2;&#x3002;</p>
<p>&#x81EA;&#x7531;&#x8F6F;&#x4EF6;&#x548C;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x662F;&#x6709;&#x533A;&#x522B;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4E8C;&#x8005;&#x7684;&#x533A;&#x522B;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x6E05;&#x6670;&#xFF0C;&#x6240;&#x4EE5;&#x201C;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x201D;&#x5B98;&#x65B9;&#x7684;&#x8BF4;&#x6CD5;&#x5176;&#x5B9E;&#x662F; FOSS &#xFF0C;&#x4E5F;&#x5C31;&#x662F; Free and Open Source Software &#x3002;&#x5982;&#x679C;&#x5177;&#x4F53;&#x60F3;&#x67E5;&#x770B;&#x201D;&#x81EA;&#x7531;&#x8F6F;&#x4EF6;&#x201C;&#x548C;&#x201D;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x201C;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x53EF;&#x4EE5;&#x5BF9;&#x6BD4; GPL v1 &#x548C; GPL v3 &#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x534F;&#x8BAE;&#x90FD;&#x662F; Richard &#x64B0;&#x5199;&#x7684;&#xFF0C;Linux &#x9879;&#x76EE;&#x5C31;&#x662F;&#x57FA;&#x4E8E; GPL v1 &#x53D1;&#x5E03;&#x7684;&#xFF0C;Linux &#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x662F;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x4E4B;&#x7956;&#x3002;&#x4F46;&#x662F; Richard &#x89C9;&#x5F97; v1 &#x4E0D;&#x591F;&#x6FC0;&#x8FDB;&#xFF0C;&#x6240;&#x4EE5;&#x624D;&#x6709;&#x4E86; v3 &#x3002;&#x7C97;&#x7565;&#x6765;&#x8BB2;&#xFF0C;&#x81EA;&#x7531;&#x8F6F;&#x4EF6;&#x628A;&#x5927;&#x4F17;&#x5BF9;&#x8F6F;&#x4EF6;&#x6E90;&#x7801;&#x7684;&#x63A7;&#x5236;&#x6743;&#x53D1;&#x6325;&#x5230;&#x4E86;&#x6781;&#x81F4;&#xFF0C;&#x4E8E;&#x662F;&#x5BF9;&#x5546;&#x4E1A;&#x5316;&#x4E0D;&#x662F;&#x7279;&#x522B;&#x53CB;&#x597D;&#xFF0C;&#x800C;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x662F;&#x517C;&#x987E;&#x516C;&#x53F8;&#x7684;&#x5546;&#x4E1A;&#x6A21;&#x5F0F;&#x7684;&#x3002;</p>
<p>Richard &#x662F;&#x975E;&#x5E38;&#x6FC0;&#x8FDB;&#x7684;&#x3002;&#x4ED6;&#x8BA8;&#x538C; Copyright &#xFF0C;&#x56E0;&#x4E3A; Copyright &#x9650;&#x5236;&#x4E86;&#x666E;&#x901A;&#x4EBA;&#x62E5;&#x6709;&#x548C;&#x6539;&#x52A8;&#x8F6F;&#x4EF6;&#x6E90;&#x7801;&#x7684;&#x6743;&#x529B;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x4E3B;&#x5F20; Copyleft &#xFF0C;Copyleft &#x610F;&#x5473;&#x7740;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x4EAB;&#x6709;&#x5BF9;&#x6E90;&#x7801;&#x7684;&#x4F7F;&#x7528;&#x6743;&#x548C;&#x4FEE;&#x6539;&#x6743;&#xFF0C;&#x540C;&#x65F6;&#x5982;&#x679C;&#x4F60;&#x5728;&#x4EE5; Copyleft &#x6388;&#x6743;&#x7684;&#x4EE3;&#x7801;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x6DFB;&#x52A0;&#x4E86;&#x65B0;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5F00;&#x53D1;&#x7684;&#x529F;&#x80FD;&#x4E5F;&#x5FC5;&#x987B;&#x662F; Copyleft &#x7684;&#x3002;&#x663E;&#x7136; Copyleft &#x662F;&#x6709;&#x75C5;&#x6BD2;&#x6027;&#x7684;&#x3002;</p>
<h2 id="&#x7F16;&#x7A0B;&#x5927;&#x5E08;">&#x7F16;&#x7A0B;&#x5927;&#x5E08;</h2>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x8BF4;&#x8BF4; Richard &#x7684;&#x4E3B;&#x8981;&#x8F6F;&#x4EF6;&#x4F5C;&#x54C1;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x4E2A;&#x662F; GNU &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;&#x8FD9;&#x4E2A;&#x8981;&#x4ECE;&#x4E00;&#x4E2A;&#x6709;&#x610F;&#x601D;&#x7684;&#x6545;&#x4E8B;&#x8BF4;&#x8D77;&#xFF0C;Richard &#x5E74;&#x8F7B;&#x65F6;&#x7528;&#x5230;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#xFF0C;&#x7ED3;&#x679C;&#x53D1;&#x73B0;&#x6709; Bug &#x3002;&#x4ED6;&#x4E8E;&#x662F;&#x627E;&#x5382;&#x5546;&#x8981;&#x4EE3;&#x7801;&#xFF0C;&#x8BF4;&#x8981;&#x5E2E;&#x52A9;&#x5382;&#x5546;&#x4FEE;&#x6539;&#x4E00;&#x4E0B;&#xFF0C;&#x7ED3;&#x679C;&#x5382;&#x5546;&#x8BF4;&#x4EE3;&#x7801;&#x662F;&#x6709;&#x5546;&#x4E1A;&#x7248;&#x6743;&#x4FDD;&#x62A4;&#x7684;&#xFF0C;&#x4E0D;&#x80FD;&#x7ED9;&#x4ED6;&#x4EE3;&#x7801;&#x3002;Richard &#x89C9;&#x5F97;&#x8FD9;&#x4E2A;&#x4E8B;&#x60C5;&#x5F88;&#x4E0D;&#x5408;&#x7406;&#xFF0C;&#x80FD;&#x4E0D;&#x80FD;&#x81EA;&#x5DF1;&#x5B9E;&#x73B0;&#x4E00;&#x5957;&#x5B8C;&#x5168;&#x81EA;&#x7531;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5462;&#xFF1F;&#x5355;&#x67AA;&#x5339;&#x9A6C;&#xFF0C;&#x8BF4;&#x5E72;&#x5C31;&#x5E72;&#xFF0C; GNU &#x9879;&#x76EE;&#x5C31;&#x8BDE;&#x751F;&#x4E86;&#x3002;GNU &#x7CFB;&#x7EDF;&#x6700;&#x7EC8;&#x6CA1;&#x6709;&#x72EC;&#x7ACB;&#x6210;&#x540D;&#xFF0C;&#x4F46;&#x662F; Linux &#x7CFB;&#x7EDF;&#x4E0A;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x7684;&#x8F6F;&#x4EF6;&#x90FD;&#x662F;&#x6765;&#x81EA; GNU &#x7CFB;&#x7EDF;&#x7684;&#xFF0C;&#x5BF9;&#xFF0C;&#x4F60;&#x6CA1;&#x6709;&#x542C;&#x9519;&#xFF0C;&#x662F;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x662F; Gcc &#x7F16;&#x8BD1;&#x5668;&#x3002;GNU &#x7CFB;&#x7EDF;&#x662F;&#x7531;&#x5F88;&#x591A;&#x4E2A;&#x8F6F;&#x4EF6;&#x7EC4;&#x6210;&#x7684;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E9B;&#x7684;&#x7B2C;&#x4E00;&#x4F5C;&#x8005;&#x4E0D;&#x662F; Richard &#x3002;&#x4F46;&#x662F;&#xFF0C;Gcc &#xFF0C;&#x4E5F;&#x5C31;&#x662F; GNU &#x7684; C &#x7F16;&#x8BD1;&#x5668;&#x662F;&#x51FA;&#x81EA; Richard &#x4E4B;&#x624B;&#x3002;&#x6CA1;&#x6709; Gcc &#xFF0C;&#x90A3;&#x4E48; Linus &#x540E;&#x6765;&#x5C31;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x53BB;&#x7F16;&#x8BD1; Linux &#x4EE3;&#x7801;&#x4E86;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x4E2A;&#x662F; Emacs &#x7F16;&#x8F91;&#x5668;&#x3002;&#x719F;&#x6089;&#x7F16;&#x8F91;&#x5668;&#x4E4B;&#x6218;&#x7684;&#x4EBA;&#x81EA;&#x7136;&#x4E4B;&#x9053;&#x8FD9;&#x6B3E;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x6C5F;&#x6E56;&#x5730;&#x4F4D;&#xFF0C;&#x4E0D;&#x591A;&#x8BF4;&#x3002;</p>
<p>Richard &#x53F7;&#x79F0;&#x4E16;&#x754C;&#x4E0A;&#x5199;&#x4EE3;&#x7801;&#x6700;&#x591A;&#x7684;&#x4EBA;&#x4E4B;&#x4E00;&#xFF0C;&#x6240;&#x4EE5;&#x4F5C;&#x54C1;&#x5F88;&#x591A;&#xFF0C;&#x4E0D;&#x4E00;&#x4E00;&#x5217;&#x4E3E;&#x4E86;&#x3002;</p>
<h2 id="&#x9ED1;&#x5BA2;&#x5E1D;&#x56FD;&#x4E2D;&#x7684;&#x9884;&#x8A00;&#x5BB6;">&#x9ED1;&#x5BA2;&#x5E1D;&#x56FD;&#x4E2D;&#x7684;&#x9884;&#x8A00;&#x5BB6;</h2>
<p>Richard &#x7684;&#x6C5F;&#x6E56;&#x5730;&#x4F4D;&#x53EF;&#x4EE5;&#x7528;&#x7535;&#x5F71;&#x9ED1;&#x5BA2;&#x5E1D;&#x56FD;&#x7684;&#x89D2;&#x8272;&#x6765;&#x505A;&#x4E2A;&#x6BD4;&#x55BB;&#x3002;</p>
<p><img src="https://img.haoqicat.com/2019072201.jpg" alt=""></p>
<p>Richard &#x53D1;&#x8D77;&#x81EA;&#x7531;&#x8F6F;&#x4EF6;&#x8FD0;&#x52A8;&#xFF0C;&#x662F;&#x65F6;&#x4EE3;&#x7684;&#x9884;&#x8A00;&#x5BB6;&#x3002;&#x5BF9;&#x5E94;&#x9ED1;&#x5BA2;&#x5E1D;&#x56FD;&#x4E2D;&#x7684;&#x89D2;&#x8272;&#x662F;&#x9884;&#x8A00;&#x5BB6; Morpheus &#x3002;Morpheus &#x81EA;&#x5DF1;&#x6218;&#x6597;&#x529B;&#x4E5F;&#x5F88;&#x5F3A;&#xFF0C;&#x5BF9;&#x5E94; Richard &#x4E5F;&#x4E3A; Linux &#x6700;&#x7EC8;&#x7684;&#x817E;&#x98DE;&#x5960;&#x5B9A;&#x4E86;&#x575A;&#x5B9E;&#x7684;&#x57FA;&#x7840;&#x3002;</p>
<p>&#x81EA;&#x7531;&#x8F6F;&#x4EF6;&#x5BF9;&#x6297;&#x7684;&#x662F;&#x5FAE;&#x8F6F;&#x53D1;&#x8D77;&#x7684;&#x5546;&#x4E1A;&#x8F6F;&#x4EF6;&#x8FD0;&#x52A8;&#x3002;&#x9ED1;&#x5BA2;&#x5E1D;&#x56FD;&#x4E2D;&#x90A3;&#x4E2A;&#x5927;&#x53CD;&#x6D3E;&#x80FD;&#x591F;&#x65E0;&#x9650;&#x7684;&#x590D;&#x5236;&#x81EA;&#x5DF1;&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x73B0;&#x5B9E;&#x4EBA;&#x7269;&#x5C31;&#x662F;&#x6BD4;&#x5C14;&#x76D6;&#x8328;&#x3002;&#x4E54;&#x5E03;&#x65AF;&#x8BF4;&#x8FC7;&#x7684;&#xFF1A;</p>
<blockquote>
<p>&#x5728; Bill &#x4E4B;&#x524D;&#xFF0C;&#x5927;&#x5BB6;&#x6839;&#x672C;&#x4E0D;&#x77E5;&#x9053;&#x8F6F;&#x4EF6;&#x8FD8;&#x80FD;&#x72EC;&#x7ACB;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x884C;&#x4E1A;</p>
</blockquote>
<p>&#x76D6;&#x8328;&#x7684;&#x4E3B;&#x5F20;&#x5C31;&#x662F;&#x5356; Copy &#xFF0C;&#x5BF9;&#x5E94;&#x7535;&#x5F71;&#x4E2D;&#x7684;&#x4EBA;&#x7269;&#x6709;&#x975E;&#x5E38;&#x5F3A;&#x7684; copy &#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x9769;&#x547D;&#x7684;&#x771F;&#x6B63;&#x6210;&#x529F;&#xFF0C;&#x5173;&#x952E;&#x4EBA;&#x7269;&#x662F;&#x7535;&#x5F71;&#x7684;&#x4E3B;&#x89D2; Neo &#x3002;GNU &#x7CFB;&#x7EDF;&#x53D1;&#x5C55;&#x4E86;&#x5341;&#x5E74;&#xFF0C;&#x4F46;&#x662F;&#x7CFB;&#x7EDF;&#x7684;&#x5185;&#x6838;&#x603B;&#x662F;&#x4E0D;&#x592A;&#x7A33;&#x5B9A;&#xFF0C;&#x800C; Linux &#x7684;&#x51FA;&#x73B0;&#x5F25;&#x8865;&#x4E86;&#x8FD9;&#x4E2A;&#x7F3A;&#x61BE;&#x3002;&#x6240;&#x4EE5; Linus &#x5C31;&#x662F; Neo &#x3002;</p>
<p>&#x4E0A;&#x9762;&#x7684;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#xFF0C;&#x6211;&#x662F;&#x5728;&#x7F51;&#x4E0A;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x4E0D;&#x592A;&#x6E05;&#x695A;&#x662F;&#x4E0D;&#x662F;&#x9ED1;&#x5BA2;&#x5E1D;&#x56FD;&#x7F16;&#x5267;&#x7684;&#x672C;&#x610F;&#xFF0C;&#x4F46;&#x662F;&#x7684;&#x786E;&#x662F;&#x5F88;&#x6709;&#x8BF4;&#x670D;&#x529B;&#x7684;&#xFF0C;&#x5C31;&#x8FDE; Eric Steven Raymond &#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x201D;&#x5F00;&#x6E90;&#x201C;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x7684;&#x4E3B;&#x8981;&#x63D0;&#x51FA;&#x8005;&#x548C;&#x9610;&#x91CA;&#x8005;&#xFF0C;&#x90FD;&#x5728;&#x5267;&#x4E2D;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x89D2;&#x8272;&#x3002;</p>
<h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2>
<p>&#x5766;&#x7387;&#x7684;&#x8BF4;&#xFF0C;&#x81EA;&#x7531;&#x8F6F;&#x4EF6;&#x57FA;&#x91D1;&#x4F1A;&#x548C; Richard &#x672C;&#x4EBA;&#x7684;&#x601D;&#x60F3;&#x56E0;&#x4E3A;&#x8FC7;&#x4E8E;&#x6FC0;&#x8FDB;&#xFF0C;&#x591A;&#x5E74;&#x6765;&#x5728;&#x7F8E;&#x56FD;&#x4E3B;&#x6D41;&#x793E;&#x4F1A;&#x4E2D;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x53D7;&#x6B22;&#x8FCE;&#x3002;Linus &#x4E5F;&#x8BF4; Richard &#x5BF9;&#x4E8B;&#x7269;&#x7684;&#x8BA4;&#x8BC6;&#x8FC7;&#x4E8E;&#x975E;&#x9ED1;&#x5373;&#x767D;&#xFF0C;Eric Steven Raymond &#x8BF4;&#xFF1A;</p>
<blockquote>
<p>&#x5E76;&#x4E0D;&#x662F;&#x4ED6;&#x7684;&#x57FA;&#x672C;&#x65B9;&#x5411;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x95EE;&#x9898;&#x662F;&#x4ED6;&#x7684;&#x90A3;&#x4E9B;&#x8A00;&#x8BBA;&#x8BF4;&#x670D;&#x4E0D;&#x4E86;&#x4EFB;&#x4F55;&#x4EBA;</p>
</blockquote>
<p>&#x5C3D;&#x7BA1;&#x8FD9;&#x6837;&#xFF0C;&#x7F8E;&#x56FD;&#x4E5F;&#x7ED9;&#x4E86; Richard &#x9EA6;&#x514B;&#x963F;&#x745F;&#x5929;&#x624D;&#x5956;&#xFF0C;&#x548C;&#x79D1;&#x5B66;&#x9662;&#x9662;&#x58EB;&#x7684;&#x5730;&#x4F4D;&#x3002;Peter &#x4E2A;&#x4EBA;&#x89C9;&#x5F97;&#xFF0C;&#x5728;&#x672A;&#x6765;&#xFF0C;Richard &#x7684;&#x4E3B;&#x5F20;&#x6709;&#x53EF;&#x80FD;&#x770B;&#x8D77;&#x6765;&#x5C31;&#x4E0D;&#x90A3;&#x4E48;&#x6FC0;&#x8FDB;&#x4E86;&#xFF0C;&#x5728;&#x73B0;&#x5728;&#xFF0C;&#x4E16;&#x754C;&#x80FD;&#x5BB9;&#x5F97;&#x4E0B;&#x4ED6;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#xFF0C;&#x4E5F;&#x662F;&#x8BA9;&#x4EBA;&#x611F;&#x89C9;&#x5F88;&#x5E78;&#x798F;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x6700;&#x540E;&#x7528; Richard &#x7684;&#x4E00;&#x53E5;&#x8BDD;&#x6765;&#x7ED3;&#x675F;&#x672C;&#x6587;&#xFF0C;&#x8FD9;&#x53E5;&#x8BDD;&#x5728;&#x5927;&#x516C;&#x53F8;&#x901A;&#x8FC7; App &#x5784;&#x65AD;&#x5404;&#x4E2A;&#x884C;&#x4E1A;&#x7684;&#x4ECA;&#x5929;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x683C;&#x5916;&#x6709;&#x6DF1;&#x610F;&#xFF1A;</p>
<blockquote>
<p>If the users don&apos;t control the program, the program controls the users. With proprietary software, there is always some entity, the &quot;owner&quot; of the program, that controls the program and through it, exercises power over its users. A nonfree program is a yoke, an instrument of unjust power.</p>
<p>&#x5982;&#x679C;&#x7528;&#x6237;&#x4E0D;&#x80FD;&#x63A7;&#x5236;&#x7A0B;&#x5E8F;&#xFF0C;&#x7A0B;&#x5E8F;&#x5C31;&#x4F1A;&#x63A7;&#x5236;&#x7528;&#x6237;&#x3002;&#x901A;&#x8FC7;&#x4E13;&#x6709;&#x8F6F;&#x4EF6;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x7A0B;&#x5E8F;&#x7684;&#x6240;&#x6709;&#x8005;&#x603B;&#x662F;&#x80FD;&#x591F;&#x83B7;&#x5F97;&#x8FC7;&#x591A;&#x7684;&#x6743;&#x529B;&#xFF0C;&#x4E0D;&#x81EA;&#x7531;&#x7684;&#x8F6F;&#x4EF6;&#x662F;&#x4E0D;&#x516C;&#x6B63;&#x7684;&#x6743;&#x529B;&#x8BDE;&#x751F;&#x7684;&#x6E29;&#x5E8A;&#x3002;</p>
</blockquote>
<p>&#x53C2;&#x8003;&#xFF1A;</p>
<ul>
<li><a href="https://en.wikipedia.org/wiki/Richard_Stallman" target="_blank">https://en.wikipedia.org/wiki/Richard_Stallman</a></li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="pg.html" class="navigation navigation-prev " aria-label="Previous page: Web App 之父-- Paul Graham">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="linus.html" class="navigation navigation-next " aria-label="Next page: Linux 之父-- Linus Torvalds">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"自由软件之父-- Richard Stallman","level":"1.6","depth":1,"next":{"title":"Linux 之父-- Linus Torvalds","level":"1.7","depth":1,"path":"linus.md","ref":"linus.md","articles":[]},"previous":{"title":"Web App 之父-- Paul Graham","level":"1.5","depth":1,"path":"pg.md","ref":"pg.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"rms.md","mtime":"2019-07-22T13:23:31.038Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2019-07-28T23:43:48.482Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

